#-*- coding : utf-8-*-
# coding:utf-8

# 渝快办字典类
class YkbDict:
    def __init__(self):
        self.sfdict = dict[('0','否'),('1','是')]

    sfdict = {
    '0': '否',
    '1': '是',
    '': '-'
    }

    isTrue = {
        True: '是',
        False: '否',
        '':'-'
    }

    sltjDict = {
        '1':'申请条件',
        '2':'禁止性条件',
        '':'-'
    }
    # 办理形式
    blxsdict = {
        '1': '窗口办理',
        '2': '网上办理',
        '3': '快递申请',
        '': '-'
    }

    #审批结果类型
    spjglxDictName={'10':'证照','20':'批文','30':'其它','99':'其它','':'-'}


    serviceObjectName = {
        '1': '自然人',
        '2': '企业法人',
        '3': '事业法人',
        '4': '社会组织法人',
        '5': '非法人企业',
        '6': '行政机关',
        '7': '7',
        '8': '8',
        '9': '其他组织',
        '': '-'
    }

    classificationInfos = {
        '0':'zrr',
        '1':'fr',
        '':'-'
    }

    type = {
        '10':'10',
        '20':'公共服务',
        '':'-'
    }

    #权力来源
    qllyDictName={
        '1': '法定本级行使',
        '2': '上级下放',
        '3': '上级授权',
        '4': '4',
        '5': '-',
        '': '-'
    }

    #实施主体性质
    ssztDictName={'1':'法定机关','':'-','2':'授权组织','3':'受委托组织','-':'-'}

    # 行使层级
    cjdictName = {
        '4': '县级',
        '1':'',
        '2':'2',
        '3':'3',
        '':'-'
    }
    #材料类型
    clDictName = {
        '1': '原件',
        '2': '复印件',
        '3':'原件和复印件',
        '4':'4',
        '':'-'
    }
    zzhdzbDictName = {
        '1':'纸质',
        '2':'电子',
        '3':'纸质、电子',
        '4':'4',
        '':'-'
    }
    #材料必要性
    clbyxName = {
        '0':'非必要',
        '1':'必要',
        '2':'非必要',
        '3':'3',
        '4':'4',
        '': '-'
    }

    #网上办理深度
    sdDictName = {
        '1':'互联网咨询',
        '2':'互联网收件',
        '3':'互联网预审',
        '4':'互联网受理',
        '5':'互联网办理',
        '6':'互联网结果反馈',
        '7':'互联网电子证照反馈',
        '9':'9',
        '':'-'
    }
    # 事项类型字典
    sxdictName = {
        '20': '公共服务',
        '10': '其他行政权力',
        '09': '行政裁决',
        '08': '行政奖励',
        '07': '行政确认',
        '06': '行政检查',
        '05': '行政给付',
        '04': '行政征收',
        '03': '行政强制',
        '02': '行政处罚',
        '01': '行政许可',
        '': '-'
    }

    grzt = {'005':'生育收养','010':'户籍办理','015':'民族宗教','020':'教育科研','025':'入伍服役','030':'就业创业','035':'设立变更','040':'准营准办','045':'抵押质押','050':'职业资格','055':'纳税缴费','060':'婚姻登记','065':'优待抚恤','070':'规划建设','075':'住房保障','085':'社会保障（社会保险、社会救助）','090':'证件办理','095':'交通出行','100':'旅游观光','105':'出境入境','110':'消费维权','115':'公共安全','120':'司法公证','125':'知识产权','130':'环保绿化','135':'文化体育','140':'公用事业','145':'医疗卫生','150':'离职退休','155':'死亡殡葬','998':'地方特色分类','999':'其他','':'-'}
    frzt = {'005':'设立变更','010':'准营准办','015':'资质认证','020':'年检年审','025':'税收财务','030':'人力资源','035':'社会保障','040':'投资审批','045':'融资信贷','050':'抵押质押','055':'商务贸易','060':'招标拍卖','065':'海关口岸','070':'涉外服务','075':'农林牧渔','085':'国土和规划建设','090':'交通运输','095':'环保绿化','0100':'应对气候变化','105':'水务气象','110':'医疗卫生','115':'科技创新','120':'文体教育','125':'知识产权','130':'民族宗教','135':'质量技术','140':'检验检疫','145':'安全生产','150':'公安消防','155':'司法公证','160':'公用事业','165':'法人注销','170':'档案文物','998':'地方特色分类','999':'其他','':'-'}


@staticmethod
def getSxlxName(sxlx):
    return YkbDict.sxdictName[sxlx]

@staticmethod
def getCjName(cj):
    return YkbDict.cjdictName[cj]

@staticmethod
def getServiceObjectName(object):
    return YkbDict.serviceObjectName[object]

@staticmethod
def getBlxsName(blxs):
    return YkbDict.blxsdict[blxs]

@classmethod
def getSxlxName(sxlx):
    return YkbDict.sxdictName[sxlx]


